In [4]:
from modules import mod_sql
import pandas as pd

ImportError: cannot import name 'mod_sql' from 'modules' (/Users/seungyeonkang/opt/anaconda3/lib/python3.9/site-packages/modules.py)

In [ ]:
_dt =

In [ ]:
sql_2 = """
            SELECT MIN('Units sold') FROM sales
        """
result_2 = _dt.executeAll(sql_2)
df_2 = pd.DataFrame(result_2)
df_2

NameError: name '_dt' is not defined

In [ ]:
sql_2 = """
            SELECT MAX('Units sold') FROM sales
        """
result_2 = _dt.executeAll(sql_2)
df_2 = pd.DataFrame(result_2)
df_2

In [ ]:
sql_8 = """
            
        """

In [ ]:
sql_9 = """
            SELECT
            ENAME,
                
        """

In [ ]:
sql_15 = """
            SELECT
            CONCAT(ENAME, '(', JOB, ')') AS ENAME
            FROM emp
        """
result_15 = _dt.executeAll(sql_15)
df_15 = pd.DataFrame(result_15)
df_15

NameError: name '_dt' is not defined

In [ ]:
sql_16 = """
            SELECT ENAME,
            CASE
                WHEN JOB = "ANALYST" THEN '분석가'
                WHEN JOB = "CLERK" THEN '점원'
                WHEN JOB = "MANAGER" THEN '관리자'
                WHEN JOB = "PRESIDENT" THEN '사장'
                ELSE '판매사원'
                END AS JOB
            FROM emp
        """
result_16 = _dt.executeAll(sql_16)
df_16 = pd.DataFrame(result_16)
df_16

1. emp table과 dept table을 left join 조건 dept가 같은 경우
2. 출력 컬럼은 ENAME, JOB, SAL, DEPTNO, LOC
3. ENAME, LOC은 그대로 출력
4. JOB은 각각 한글명으로 변경
5. SAL은 2450을 기준으로 2450 이상이면 HIGH 미만이면 LOW
6. DEPTNO은 DEPTNO의 값과 dept table의 DNAME 값을 더해서 표시(DEPTNO-DNAME형식)
7. 모든 컬럼의 이름은 한글로 변경

In [ ]:
sql_17 = """
            SELECT
            emp.ENAME as "사원명",
            CASE
                WHEN emp.JOB = "ANALYST" THEN '분석가'
                WHEN emp.JOB = "CLERK" THEN '점원'
                WHEN emp.JOB = "MANAGER" THEN '관리자'
                WHEN emp.JOB = "PRESIDENT" THEN '사장'
                ELSE '판매사원'
            END AS "직급",
            IF ( SAL >= 2450, "HIGH", "LOW") AS 월급,
            CONTACT(emp.DEPTNO, "-", dept.DNAME) AS "부서번호-부서명",
            dept.LOC AS "위치"
            FROM empp LEFT JOIN dept
            on emp.DEPTNO = dept.DEPTNO
            ORDER BY '사원명' ASC
        """
result_17 = _dt.executeAll(sql_17)
pd.DataFrame(result_17)

NameError: name '_dt' is not defined

In [5]:
sql_18 = """
            SELECT * FROM emp
            WHERE DEPTNO IN 10
         """
result_18 = _dt.executeAll(sql_18)
pd.DataFrame(result_18)

In [ ]:
sql_19 = """
            
            SELECT
            (
                SELECT COUNT(*) FROM emp
            ) AS 'cnt(emp)', 
            (
                SELECT COUNT(*) FROM dept
            ) AS 'cnt(dept)'
         """
result_19 = _dt.executeAll(sql_19)
pd.DataFrame(result_19)

In [ ]:
sql_20 = """
            SELECT
            ENAME
            FROM emp
            LEFT JOIN dept
            WHERE detp.DNAME = "sales"
        """
result_20 = _dt.executeAll(sql_20)
pd.DataFrame(result_20)

In [ ]:
sql_21 = """
            SELECT
            ENAME
            FROM emp
            WHERE DEPTNO = 
            (
                SELECT DEPTNO FROM dept
                WHERE DNAME = 'sales'
            )
        """
result_21 = _dt.executeAll(sql_21)
pd.DataFrame(result_21)

부서의 위치가 'NEW YORK', 'DALLAS"가 아닌 소속 사원들의 리스트를 출력하라

In [ ]:
sql_22 = """
            SELECT
            ENAME
            FROM emp
            WHERE 
            DEPTNO = 
            (
                SELECT 
                DEPTNO
                FROM dept 
                WHERE 
                LOC NOT IN ('NEW YORK', 'DALLAS')
            )
        """
result_22 = _dt.executeAll(sql_22)
pd.DataFrame(result_22)

In [ ]:
sql_23 = """
            SELECT * FROM emp
            WHERE 
            )
        """
result_23 = _dt.executeAll(sql_23)
pd.DataFrame(result_23)

In [ ]:
sql_24 = """
            SELECT * FROM emp
            WHERE SAL BETWEEN 2000 AND 5000
        """
result_24 = _dt.executeAll(sql_24)
pd.DataFrame(result_24)

In [ ]:
sql_24 = """
            SELECT * FROM emp WHERE ENAME LIKE '%%ES'
        """
result_24 = _dt.executeAll(sql_24)
pd.DataFrame(result_24)